src/posts/nginx-1-fastcgi-sent-in-stderr-primary-script-unknown/index.org
#+TITLE: Nginx + PHP-FPM: "Primary script unknown" 问题排查
#+KEYWORDS: 珊瑚礁上的程序员, nginx, php, php-fpm, fastcgi, primary script unknown
#+DATE: <2020-02-09 Sun 23:55>

前几天在笔记本上开发PHP项目的时候，想调试接口，浏览器上却无情的出现了 "File not found" 的空白页面。
笔记本上的开发环境是早就配置好了的，而且一直都是正常在用的，当时又是急着调试，却出现这种情况，顿时脑瓜子嗡嗡的。
简单排查了一下 =访问url是否正确=, =hosts文件是否正常=, =nginx root路径是否正确= ，并没有找到原因。
因为急着调试，这个问题就暂时放在一边了，先使用php内置的Web服务新起一个Server(=php -S 127.0.0.1:8001 -t /PATH/PROJECT/public=)继续调试。
今天抽时间把这个问题解决并记录一下。

*** 先说现象

    浏览器访问页面时，页面"报错" =File not found= 。

    查看 nginx 日志， 访问日志(access_log)如下：

    #+BEGIN_EXAMPLE
    127.0.0.1 - - [09/Feb/2020:22:20:48 +0800] "GET /api HTTP/1.1" 404 27 "-" "Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) C
    hrome/80.0.3987.87 Safari/537.36"
    #+END_EXAMPLE

    错误日志(error_log)如下：

    #+BEGIN_EXAMPLE
    2020/02/09 22:20:48 [error] 12451#12451: *1 FastCGI sent in stderr: "Primary script unknown" while reading response header from upstream, client: 127.0.0
    .1, server: dl.dev.com, request: "GET /api HTTP/1.1", upstream: "fastcgi://unix:/run/php-fpm/php-fpm.sock:", host: "dl.dev.com"
    #+END_EXAMPLE

*** 开发环境

    #+BEGIN_EXAMPLE
    OS: 4.19.102-1-MANJARO(Arch Linux)
    PHP Version: 7.4.2
    Nginx Version: 1.16.1
    Service Manager: Systemd 242
    #+END_EXAMPLE

*** 常见原因

    出现这个错误的原因一般有两个，一个是nginx或php-fpm确实找不到php文件，一个是php-fpm没有权限读取和执行php文件。

**** 1. 找不到文件问题

***** 1) 排查 nginx 是否访问到正确的文件路径

      可以通过 nginx 访问日志查看文件路径是否正确。

      打开 nginx 主配置文件（我的是 =/etc/nginx/nginx.conf= ）,在http代码块中增加：
      #+BEGIN_SRC sh
        # $document_root$fastcgi_script_name 其实就是 server 代码块中的 fastcgi_param SCRIPT_NAME 的值
        log_format scripts '$document_root$fastcgi_script_name > $request';
      #+END_SRC

      继续打开 nginx server 配置文件（我的是 =/etc/nginx/sites-enabled/dl.dev.com.conf= ）,在server代码块增加：
      #+BEGIN_SRC sh
        access_log /var/log/nginx/scripts.log scripts;
      #+END_SRC

      重启nginx服务（ =systemctl restart nginx.service= ），再次访问接口，可以在日志文件中看到：
      #+BEGIN_EXAMPLE
      /home/demo/Code/coco/dl/frontend/web/index.php > GET /api HTTP/1.1
      #+END_EXAMPLE

      再次确认日志文件中的文件路径，确实没错。

***** 2) 排查 php-fpm 是否访问到正确的文件

      同样是通过 php-fpm 的访问日志排查。

      编辑 php-fpm 配置文件（我的是 =/etc/php/php-fpm.d/www.conf= ）：
      #+BEGIN_SRC sh
        access.log = /var/log/php-fpm/$pool.access.log
      #+END_SRC

      重启php-fpm（ =systemctl restart php-fpm.service= ），再次访问接口，可以在日志文件中看到：
      #+BEGIN_EXAMPLE
      - -  09/Feb/2020:17:19:50 +0800 "GET /index.php" 404
      #+END_EXAMPLE

      可以看到 nginx 传递给 php-fpm 的文件确实是 =index.php=, 但 php-fpm 响应的是 404, 说明是 php-fpm 无法(无权限)访问到文件。
      #+ATTR_HTML: :class alert alert-primary
      #+BEGIN_info
      如果日志显示 =GET /= 或 =GET /api= 则说明 nginx 传递给 php-fpm 的文件名是错误的。

      如果一切正常，日志显示应该是 ="GET /index.php" 200= 。
      #+END_info

**** 2. 权限问题

***** 1) 进程用户

      nginx 进程 和 php-fpm 进程要是同一个用户。

      查看 nginx 和 php-fpm 进程信息:
      #+BEGIN_SRC sh
        ps -ef | grep nginx
        ps -ef | grep php-fpm
      #+END_SRC

      #+BEGIN_EXAMPLE
      ➜ ps -ef | grep nginx
      root     13038     1  0 12:05 ?        00:00:00 nginx: master process /usr/bin/nginx -g pid /run/nginx.pid; error_log stderr;
      demo     13039 13038  0 12:05 ?        00:00:00 nginx: worker process
      demo     13040 13038  0 12:05 ?        00:00:00 nginx: worker process
      #+END_EXAMPLE

      #+BEGIN_EXAMPLE
      ➜ ps -ef | grep php-fpm
      root     13022     1  0 12:05 ?        00:00:00 php-fpm: master process (/etc/php/php-fpm.conf)
      demo     13041 13022  0 12:05 ?        00:00:00 php-fpm: pool www
      demo     13042 13022  0 12:05 ?        00:00:00 php-fpm: pool www
      #+END_EXAMPLE

      可以看到 nginx 和 php-fpm 进程所属用户都是 =demo=, 说明配置没有问题。

      如果两个进程所属用户不同，需要修改如下配置文件：

      =nginx.conf= :
      #+BEGIN_SRC sh
        user demo;
      #+END_SRC

      =php-fpm.d/www.conf= :
      #+BEGIN_SRC sh
        ; Unix user/group of processes
        ; Note: The user is mandatory. If the group is not set, the default user's group
        ;       will be used.
        user = demo
        group = demo

        ; Set permissions for unix socket, if one is used. In Linux, read/write
        ; permissions must be set in order to allow connections from a web server. Many
        ; BSD-derived systems allow connections regardless of permissions.
        ; Default Values: user and group are set as the running user
        ;                 mode is set to 0660
        listen.owner = demo
        listen.group = demo
        ;listen.mode = 0660
      #+END_SRC

      #+ATTR_HTML: :class alert alert-primary
      #+BEGIN_info
      在开发环境下，建议进程用户配置为当前登录用户即可，可以避免处理一些目录和文件权限问题，省心。
      #+END_info

      记得配置修改后，需要重启服务才能生效。
      #+BEGIN_SRC sh
        systemctl restart nginx.service php-fpm.service
      #+END_SRC

***** 2) 目录和文件权限

      nginx 和 php-fpm 进程运行用户对 php 入口文件必须要有 =可读(r)= 权限，对入口文件所在目录（逐级目录）必须要有 =可执行(x)= 权限。

      #+ATTR_HTML: :class alert alert-primary
      #+BEGIN_info
      通常，目录无可执行权限，页面报错为 =File not found.=

      文件无可读权限，页面报错为 =Access denied.=
      #+END_info


      逐级检查目录和文件权限，我的结果如下：
      #+BEGIN_EXAMPLE
      drwxr-xr-x  3 root root 4.0K  1月 20  2019 /home
      drwx------ 58 demo demo 4.0K  2月 13 14:33 /home/demo
      drwxr-xr-x  6 demo demo 4.0K  2月  9 16:37 /home/demo/Code
      drwxr-xr-x 10 demo demo 4.0K 11月 11 21:39 /home/demo/Code/coco
      drwxr-xr-x 11 demo demo 4.0K  2月 12 22:19 /home/demo/Code/coco/dl
      drwxr-xr-x 11 demo demo 4.0K  2月  3 11:00 /home/demo/Code/coco/dl/frontend
      drwxr-xr-x  4 demo demo 4.0K  2月 12 22:18 /home/demo/Code/coco/dl/frontend/web
      -rw-r--r--  1 demo demo 611   8月 14  2019 /home/demo/Code/coco/dl/frontend/web/index.php
      #+END_EXAMPLE

      从结果来看，目录和文件的权限都是正常的。如果你发现自己的目录或文件权限异常，可使用 =chown= 和 =chmod= 修改。

