posts/nginx-1-fastcgi-sent-in-stderr-primary-script-unknown/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Nginx + PHP-FPM: "Primary script unknown" 问题排查</title>
<meta name="keywords" content="珊瑚礁上的程序员, nginx, php, php-fpm, fastcgi, primary script unknown" />
<meta name="generator" content="Org Mode" />
<link rel="icon" href="https://demokn.github.io/blog/favicon.ico" type="image/x-icon">
<link rel="stylesheet" href="https://demokn.github.io/blog/assets/lib/twitter-bootstrap/4.4.1/bootstrap.min.css">
<link rel="stylesheet" href="https://demokn.github.io/blog/assets/lib/font-awesome/5.12.1/all.min.css">
<link rel="stylesheet" type="text/css" href="https://fonts.googleapis.com/css?family=ZCOOL+KuaiLe|Amaranth|Handlee|Libre+Baskerville|Bree+Serif|Ubuntu+Mono|Pacifico&subset=latin,greek"/>
<link rel="stylesheet" href="https://demokn.github.io/blog/assets/css/site.css">
<link rel="stylesheet" href="https://demokn.github.io/blog/assets/css/highlight.css">
</head>
<body>
<div class="content-wrapper container">
<div class="row">
<div class="col-lg-8 col-md-10 mx-auto">

<div id="preamble" class="status">
<div class="banner">
  <a href="/" style="font-family: 'ZCOOL KuaiLe', cursive;"> 珊瑚礁上的程序员 </a>
</div>
<ul class="banner-links">
  <li><a href="https://demokn.github.io/blog/posts/archive.html"> Archive </a></li>
  <li><a href="https://demokn.github.io/blog/posts/rss.xml"> RSS </a></li>
  <li><a href="https://demokn.github.io/blog/about.html"> About </a></li>
</ul>
<hr>
</div>
<div id="article" class="content">
<header>
<h1 class="title">Nginx + PHP-FPM: &ldquo;Primary script unknown&rdquo; 问题排查</h1>
<p class="subtitle" role="doc-subtitle">发布于 2020-02-09</p>
</header><p>
前几天在笔记本上开发PHP项目的时候，想调试接口，浏览器上却无情的出现了 &ldquo;File not found&rdquo; 的空白页面。
笔记本上的开发环境是早就配置好了的，而且一直都是正常在用的，当时又是急着调试，却出现这种情况，顿时脑瓜子嗡嗡的。
简单排查了一下 <code>访问url是否正确</code>, <code>hosts文件是否正常</code>, <code>nginx root路径是否正确</code> ，并没有找到原因。
因为急着调试，这个问题就暂时放在一边了，先使用php内置的Web服务新起一个Server(<code>php -S 127.0.0.1:8001 -t /PATH/PROJECT/public</code>)继续调试。
今天抽时间把这个问题解决并记录一下。
</p>

<section id="outline-container-orgb775592" class="outline-2">
<h2 id="orgb775592">先说现象</h2>
<div class="outline-text-2" id="text-orgb775592">
<p>
浏览器访问页面时，页面&ldquo;报错&rdquo; <code>File not found</code> 。
</p>

<p>
查看 nginx 日志， 访问日志(access_log)如下：
</p>

<pre class="example" id="org53f9bd7">
127.0.0.1 - - [09/Feb/2020:22:20:48 +0800] "GET /api HTTP/1.1" 404 27 "-" "Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/80.0.3987.87 Safari/537.36"
</pre>

<p>
错误日志(error_log)如下：
</p>

<pre class="example" id="org4f74c5c">
2020/02/09 22:20:48 [error] 12451#12451: *1 FastCGI sent in stderr: "Primary script unknown" while reading response header from upstream, client: 127.0.0.1, server: dl.dev.com, request: "GET /api HTTP/1.1", upstream: "fastcgi://unix:/run/php-fpm/php-fpm.sock:", host: "dl.dev.com"
</pre>
</div>
</section>

<section id="outline-container-org0b2a88a" class="outline-2">
<h2 id="org0b2a88a">开发环境</h2>
<div class="outline-text-2" id="text-org0b2a88a">
<pre class="example" id="org6e38913">
OS: 4.19.102-1-MANJARO(Arch Linux)
PHP Version: 7.4.2
Nginx Version: 1.16.1
Service Manager: Systemd 242
</pre>
</div>
</section>

<section id="outline-container-orgf2f47da" class="outline-2">
<h2 id="orgf2f47da">常见原因</h2>
<div class="outline-text-2" id="text-orgf2f47da">
<p>
出现这个错误的原因一般有两个，一个是nginx或php-fpm确实找不到php文件，一个是php-fpm没有权限读取和执行php文件。
</p>
</div>

<div id="outline-container-orgf9e2a16" class="outline-3">
<h3 id="orgf9e2a16">1. 找不到文件问题</h3>
<div class="outline-text-3" id="text-orgf9e2a16">
</div>
<div id="outline-container-org531fc13" class="outline-4">
<h4 id="org531fc13">1) 排查 nginx 是否访问到正确的文件路径</h4>
<div class="outline-text-4" id="text-org531fc13">
<p>
可以通过 nginx 访问日志查看文件路径是否正确。
</p>

<p>
打开 nginx 主配置文件（我的是 <code>/etc/nginx/nginx.conf</code> ）,在http代码块中增加：
</p>
<div class="org-src-container">
<pre class="src src-conf"><span class="org-comment-delimiter"># </span><span class="org-comment">$document_root$fastcgi_script_name &#20854;&#23454;&#23601;&#26159; server &#20195;&#30721;&#22359;&#20013;&#30340; fastcgi_param SCRIPT_NAME &#30340;&#20540;</span>
log_format scripts <span class="org-string">'$document_root$fastcgi_script_name &gt; $request'</span>;
</pre>
</div>

<p>
继续打开 nginx server 配置文件（我的是 <code>/etc/nginx/sites-enabled/dl.dev.com.conf</code> ）,在server代码块增加：
</p>
<div class="org-src-container">
<pre class="src src-conf">access_log /var/log/nginx/scripts.log scripts;
</pre>
</div>

<p>
重启nginx服务（ <code>systemctl restart nginx.service</code> ），再次访问接口，可以在日志文件中看到：
</p>
<pre class="example" id="org145f5b4">
/home/demo/Code/coco/dl/frontend/web/index.php &gt; GET /api HTTP/1.1
</pre>

<p>
再次确认日志文件中的文件路径，确实没错。
</p>
</div>
</div>

<div id="outline-container-org2f97fbd" class="outline-4">
<h4 id="org2f97fbd">2) 排查 php-fpm 是否访问到正确的文件</h4>
<div class="outline-text-4" id="text-org2f97fbd">
<p>
同样是通过 php-fpm 的访问日志排查。
</p>

<p>
编辑 php-fpm 配置文件（我的是 <code>/etc/php/php-fpm.d/www.conf</code> ）：
</p>
<div class="org-src-container">
<pre class="src src-conf"><span class="org-variable-name">access.log</span> = /var/log/php-fpm/$pool.access.log
</pre>
</div>

<p>
重启php-fpm（ <code>systemctl restart php-fpm.service</code> ），再次访问接口，可以在日志文件中看到：
</p>
<pre class="example" id="org0b24e89">
- -  09/Feb/2020:17:19:50 +0800 "GET /index.php" 404
</pre>

<p>
可以看到 nginx 传递给 php-fpm 的文件确实是 <code>index.php</code>, 但 php-fpm 响应的是 404, 说明是 php-fpm 无法(无权限)访问到文件。
</p>
<div class="alert alert-primary info" id="orgbee519c">
<p>
如果日志显示 <code>GET /</code> 或 <code>GET /api</code> 则说明 nginx 传递给 php-fpm 的文件名是错误的。
</p>

<p>
如果一切正常，日志显示应该是 <code>"GET /index.php" 200</code> 。
</p>

</div>
</div>
</div>
</div>

<div id="outline-container-orga0e2cdc" class="outline-3">
<h3 id="orga0e2cdc">2. 权限问题</h3>
<div class="outline-text-3" id="text-orga0e2cdc">
</div>
<div id="outline-container-org222a88b" class="outline-4">
<h4 id="org222a88b">1) 进程用户</h4>
<div class="outline-text-4" id="text-org222a88b">
<p>
nginx 进程 和 php-fpm 进程要是同一个用户。
</p>

<p>
查看 nginx 和 php-fpm 进程信息:
</p>
<div class="org-src-container">
<pre class="src src-sh">ps -ef | grep nginx
ps -ef | grep php-fpm
</pre>
</div>

<pre class="example" id="orged8baa7">
➜ ps -ef | grep nginx
root     13038     1  0 12:05 ?        00:00:00 nginx: master process /usr/bin/nginx -g pid /run/nginx.pid; error_log stderr;
demo     13039 13038  0 12:05 ?        00:00:00 nginx: worker process
demo     13040 13038  0 12:05 ?        00:00:00 nginx: worker process
</pre>

<pre class="example" id="org58428c3">
➜ ps -ef | grep php-fpm
root     13022     1  0 12:05 ?        00:00:00 php-fpm: master process (/etc/php/php-fpm.conf)
demo     13041 13022  0 12:05 ?        00:00:00 php-fpm: pool www
demo     13042 13022  0 12:05 ?        00:00:00 php-fpm: pool www
</pre>

<p>
可以看到 nginx 和 php-fpm 进程所属用户都是 <code>demo</code>, 说明配置没有问题。
</p>

<p>
如果两个进程所属用户不同，需要修改如下配置文件：
</p>

<p>
<code>nginx.conf</code> :
</p>
<div class="org-src-container">
<pre class="src src-conf">user demo;
</pre>
</div>

<p>
<code>php-fpm.d/www.conf</code> :
</p>
<div class="org-src-container">
<pre class="src src-conf">; Unix user/group of processes
; Note: The user is mandatory. If the group is not set, the default user<span class="org-string">'s group</span>
<span class="org-string">;       will be used.</span>
<span class="org-string">user = demo</span>
<span class="org-string">group = demo</span>

<span class="org-string">; Set permissions for unix socket, if one is used. In Linux, read/write</span>
<span class="org-string">; permissions must be set in order to allow connections from a web server. Many</span>
<span class="org-string">; BSD-derived systems allow connections regardless of permissions.</span>
<span class="org-string">; Default Values: user and group are set as the running user</span>
<span class="org-string">;                 mode is set to 0660</span>
<span class="org-string">listen.owner = demo</span>
<span class="org-string">listen.group = demo</span>
<span class="org-string">;listen.mode = 0660</span>
</pre>
</div>

<div class="alert alert-primary info" id="org0c5b4de">
<p>
在开发环境下，建议进程用户配置为当前登录用户即可，可以避免处理一些目录和文件权限问题，省心。
</p>

</div>

<p>
记得配置修改后，需要重启服务才能生效。
</p>
<div class="org-src-container">
<pre class="src src-sh">systemctl restart nginx.service php-fpm.service
</pre>
</div>
</div>
</div>

<div id="outline-container-org1b15919" class="outline-4">
<h4 id="org1b15919">2) 目录和文件权限</h4>
<div class="outline-text-4" id="text-org1b15919">
<p>
nginx 和 php-fpm 进程运行用户对 php 入口文件必须要有 <code>可读(r)</code> 权限，对入口文件所在目录（逐级目录）必须要有 <code>可执行(x)</code> 权限。
</p>

<div class="alert alert-primary info" id="org127657a">
<p>
通常，目录无可执行权限，页面报错为 <code>File not found.</code>
</p>

<p>
文件无可读权限，页面报错为 <code>Access denied.</code>
</p>

</div>

<p>
逐级检查目录和文件权限，我的结果如下：
</p>
<pre class="example" id="org20a7d44">
drwxr-xr-x  3 root root 4.0K  1月 20  2019 /home
drwx------ 58 demo demo 4.0K  2月 13 14:33 /home/demo
drwxr-xr-x  6 demo demo 4.0K  2月  9 16:37 /home/demo/Code
drwxr-xr-x 10 demo demo 4.0K 11月 11 21:39 /home/demo/Code/coco
drwxr-xr-x 11 demo demo 4.0K  2月 12 22:19 /home/demo/Code/coco/dl
drwxr-xr-x 11 demo demo 4.0K  2月  3 11:00 /home/demo/Code/coco/dl/frontend
drwxr-xr-x  4 demo demo 4.0K  2月 12 22:18 /home/demo/Code/coco/dl/frontend/web
-rw-r--r--  1 demo demo 611   8月 14  2019 /home/demo/Code/coco/dl/frontend/web/index.php
</pre>

<p>
从结果来看，目录和文件的权限都是正常的。如果你发现自己的目录或文件权限异常，可使用 <code>chown</code> 和 <code>chmod</code> 修改。
</p>
</div>
</div>
</div>
</section>
